#### terraform init `success`
#### terraform plan `success`

<details>
  <summary>Plan Result</summary>

  ```
  google_compute_network.test-network: Refreshing state... [id=projects/learn-terraform-322811/global/networks/test-network]
google_service_account.cloud-run-sa: Refreshing state... [id=projects/learn-terraform-322811/serviceAccounts/cloud-run-sa@learn-terraform-322811.iam.gserviceaccount.com]
google_project_service.project["run.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/run.googleapis.com]
google_project_service.project["sqladmin.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/sqladmin.googleapis.com]
google_project_service.project["iam.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/iam.googleapis.com]
google_project_service.project["compute.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/compute.googleapis.com]
google_project_service.project["containerregistry.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/containerregistry.googleapis.com]
google_sql_database_instance.sql-test-instance: Refreshing state... [id=sql-test-instance]
google_project_iam_member.sql-for-cloud-run-iam: Refreshing state... [id=learn-terraform-322811/roles/cloudsql.client/serviceAccount:cloud-run-sa@learn-terraform-322811.iam.gserviceaccount.com]
google_project_iam_member.cloud-run-agent-iam: Refreshing state... [id=learn-terraform-322811/roles/run.serviceAgent/serviceAccount:cloud-run-sa@learn-terraform-322811.iam.gserviceaccount.com]
google_compute_subnetwork.test-subnetwork1: Refreshing state... [id=projects/learn-terraform-322811/regions/asia-northeast1/subnetworks/test-subnetwork1]
google_compute_firewall.test-firewall: Refreshing state... [id=projects/learn-terraform-322811/global/firewalls/test-firewall]
google_sql_database.sql-test-db: Refreshing state... [id=projects/learn-terraform-322811/instances/sql-test-instance/databases/sql-test-db]
google_cloud_run_service.cloud-run-test: Refreshing state... [id=locations/asia-northeast1/namespaces/learn-terraform-322811/services/cloud-run-test]
google_compute_instance.test-server: Refreshing state... [id=projects/learn-terraform-322811/zones/asia-northeast1-b/instances/test-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.cloud-run-test will be updated in-place
  ~ resource "google_cloud_run_service" "cloud-run-test" {
        id                         = "locations/asia-northeast1/namespaces/learn-terraform-322811/services/cloud-run-test"
        name                       = "cloud-run-test"
        # (4 unchanged attributes hidden)


      ~ template {
          ~ metadata {
              ~ annotations = {
                  - "autoscaling.knative.dev/maxScale"        = "100" -> null
                  + "run.googleapis.com/vpc-access-connector" = "test-network-connector"
                    # (1 unchanged element hidden)
                }
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_firewall.test-firewall will be updated in-place
  ~ resource "google_compute_firewall" "test-firewall" {
        id                      = "projects/learn-terraform-322811/global/firewalls/test-firewall"
        name                    = "test-firewall"
        # (13 unchanged attributes hidden)

      - allow {
          - ports    = [
              - "22",
              - "80",
            ] -> null
          - protocol = "tcp" -> null
        }
        # (1 unchanged block hidden)
    }

  # google_compute_subnetwork.test-connector-subnet will be created
  + resource "google_compute_subnetwork" "test-connector-subnet" {
      + creation_timestamp         = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.11.0.0/28"
      + name                       = "test-connector-subnet"
      + network                    = "projects/learn-terraform-322811/global/networks/test-network"
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + region                     = "asia-northeast1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
    }

  # google_vpc_access_connector.test-network-connector will be created
  + resource "google_vpc_access_connector" "test-network-connector" {
      + id             = (known after apply)
      + machine_type   = "f1-micro"
      + max_instances  = (known after apply)
      + max_throughput = 300
      + min_instances  = (known after apply)
      + min_throughput = 200
      + name           = "test-network-connector"
      + project        = (known after apply)
      + region         = (known after apply)
      + self_link      = (known after apply)
      + state          = (known after apply)

      + subnet {
          + name       = "test-connector-subnet"
          + project_id = (known after apply)
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```
</details>

